
SYSTEM_PROMPT_GEN_VLLM_CONTEXT = """
你是一个精确的文本提取助手，负责从文档标题和页面内容中提取核心背景信息。
你的任务是过滤掉OCR噪声和无关内容，仅保留与文档标题相关的核心思想。提炼的背景信息需要简洁明了，
并准确反映页面的主要内容，适合作为后续任务的上下文。
"""

USER_PROMPT_GEN_VLLM_CONTEXT = """
##请根据以下信息提炼页面上下文背景：

**文档标题**: 
{doc_title}  

**页面内容**: 
```
{page_content} 
``` 

**任务要求**：
- 提炼页面的核心思想，忽略无关信息或OCR噪声。
- 输出一段清晰简洁的页面上下文背景，用于后续图像分析。

**输出格式**：
页面上下文: 基于**文档标题**和**页面内容**，提炼出以下**核心背景**信息, 用JSON格式：
```json
{
    "page_context": "<页面上下文>",
}

## 你的回答：
"""

TEXT_PROMPT_INST_VLLM_IMG = """ 
你是一个专业的任务指令设计助手，负责根据页面的上下文背景构造多模态分析任务指令。
你的目标是帮助多模态模型准确分析图像的内容，判断其与页面上下文的关联性，并生成一个简洁的图像名称（FigureName）。
如果图像无关，应指导模型标明其为装饰性图像并提供简要说明, 。

## 请基于以下页面上下文分析图像，并回答以下问题：

页面上下文(该图像在这个页面里):
```  
{page_context} 
```

**任务要求**：
1. 判断图像内容是否与页面上下文相关：
   - 如果相关，请基于图像内容生成一个简洁的名称（FigureName）。
   - 如果无关，请说明图像是否为修饰性元素，并提供简短解释。FigureName设置为None。
2. 输出以下格式的结果(JSON格式）：
{
  "FigureName": "<图像名称（如相关）或 'None'>",
  "RelevanceScore": <反映图像内容和页面上下文契合的度量，用10分制，2分以下无关，5分左右有些相关，8分以上强烈相关>,
  "Explanation": "<简要说明判断依据。>"
}

## 你的回答：
"""


